In [2]:
# %load ../local_connect.py
import sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://tushar:@localhost', echo=True)
%load_ext sql
%sql mysql+mysqlconnector://tushar:@localhost
%config SqlMagic.autopandas=True

import pandas as pd
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 50)
pd.set_option('display.width', 1000)

In [4]:
%%sql
select * from test.prime_subscription_users

 * mysql+mysqlconnector://tushar:***@localhost
7 rows affected.

   user_id    name   join_date
0        1     Jon  2020-02-14
1        2    Jane  2020-02-14
2        3    Jill  2020-02-15
3        4    Josh  2020-02-15
4        5    Jean  2020-02-16
5        6  Justin  2020-02-17
6        7  Jeremy  2020-02-18

In [6]:
%%sql
select * from test.prime_subscription_events

 * mysql+mysqlconnector://tushar:***@localhost
7 rows affected.

   user_id   type access_date
0        1    Pay  2020-03-01
1        2  Music  2020-03-02
2        2      P  2020-03-12
3        3  Music  2020-03-15
4        4  Music  2020-03-15
5        1      P  2020-03-16
6        3      P  2020-03-22

In [26]:
%%sql
with amazon_music as (
select e.user_id, join_date, date_add(join_date, interval 30 day) join_date_plus_30
from test.prime_subscription_events e
join test.prime_subscription_users u
on e.user_id = u.user_id
where type='Music')
select sum(case when type='P' and access_date<join_date_plus_30 then 1 else 0 end)/count(distinct am.user_id) subs_ratio
from amazon_music am
left join test.prime_subscription_events e on e.user_id=am.user_id

 * mysql+mysqlconnector://tushar:***@localhost
1 rows affected.

  subs_ratio
0     0.3333

In [27]:
%%sql df_users <<
select * from test.prime_subscription_users

 * mysql+mysqlconnector://tushar:***@localhost
7 rows affected.
Returning data to local variable df_users

In [28]:
%%sql df_events <<
select * from test.prime_subscription_events

 * mysql+mysqlconnector://tushar:***@localhost
7 rows affected.
Returning data to local variable df_events

In [35]:
import datetime
event_with_user_info = pd.merge(df_events, df_users, on='user_id')
event_with_user_info['access_date'] = event_with_user_info['access_date'].apply(lambda _: pd.to_datetime(_, format='%Y-%m-%d'))
event_with_user_info['join_date'] = event_with_user_info['join_date'].apply(lambda _: pd.to_datetime(_, format='%Y-%m-%d'))
event_with_user_info['join_date_plus_30'] = event_with_user_info['join_date'] + datetime.timedelta(days=30)
event_with_user_info

   user_id   type access_date  name  join_date join_date_plus_30
0        1    Pay  2020-03-01   Jon 2020-02-14        2020-03-15
1        1      P  2020-03-16   Jon 2020-02-14        2020-03-15
2        2  Music  2020-03-02  Jane 2020-02-14        2020-03-15
3        2      P  2020-03-12  Jane 2020-02-14        2020-03-15
4        3  Music  2020-03-15  Jill 2020-02-15        2020-03-16
5        3      P  2020-03-22  Jill 2020-02-15        2020-03-16
6        4  Music  2020-03-15  Josh 2020-02-15        2020-03-16

In [36]:
music_count = event_with_user_info[event_with_user_info['type']=='Music']
len(music_count)

3

In [37]:
prime_users = event_with_user_info[(event_with_user_info['type']=='P') &\
                                   (event_with_user_info['access_date']<=event_with_user_info['join_date_plus_30'])]
prime_users

   user_id type access_date  name  join_date join_date_plus_30
3        2    P  2020-03-12  Jane 2020-02-14        2020-03-15